In [46]:
from google.colab import drive 
drive.mount('/content/gdrive')

Drive already mounted at /content/gdrive; to attempt to forcibly remount, call drive.mount("/content/gdrive", force_remount=True).

In [48]:
# 1. Import Data
import numpy as np
import pandas as pd
df = pd.read_csv('/content/gdrive/My Drive/Colab Notebooks/titanic.csv')

In [9]:
# 2. Data Summary of Titanic passenger list
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [11]:
age = df['Age']
age.describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [18]:
# 3. Average age of passengers
df['Age'].mean()

29.69911764705882

In [20]:
age = df['Age']
age.mean()

29.69911764705882

In [29]:
# 4. Shape of dataframe function
def df_shape():
    print(np.shape(df))

In [34]:
df_shape()

(891, 12)

In [61]:
# 5a. Average Function
def avg(data):
    avg = data.mean()
    return avg

In [63]:
# 5b. Average Age
avg(df.Age)

29.69911764705882

In [64]:
# 5c. Average Fare
avg(df.Fare)

32.2042079685746